import React from 'react'
import './AboutMe.scss'


const AboutMe = () => {
	return (
		<div className="about-me">
			<h2> {`<AboutMe>`} </h2>

			<p>Я, Калюжний Ростислав Ігорович, народився 28 травня 2000 року в м. Кіровоград. Громадянин України.</p>
			<p>У 2005 році пішов в 1 клас Соколівської загальноосвітньої школи І-ІІІ ступенів. В школі навчався 9 років. Під час навчання брав участь у шкільних та районних олімпіадах з української мови, фізики, хімії. Відвідував секції з велоспорту та футболу.</p>
			<p>З 2014 по 2018 рік навчався у Кіровоградському кібернетико-технічному коледжі за спеціальністю "Інженерія програмного забезпечення", який закінчив з відзнакою.</p>
			<p>У 2018 році вступив до Центральноукраїнського національного технічного університету на кафедру "Кібербезпеки та програмного забезпечення". Зараз навчаюсь на третьому курсі.</p>
			<p>Ні я, ні мої рідні до кримінальної відповідальності не притягувалися.</p>
			<p>Зареєстрований і проживаю за адресою: вул. Полинкіна, с. Соколівське, Кропивницького району, Кіровоградської області.</p>

			<h2> {`</AboutMe>`} </h2>
		</div>
	)
}

export default AboutMe;